Revit 2026 API

# DocumentOwnerFamily Property

---

Get the Family of this Family Document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Family OwnerFamily { get; }
```
```vb
Public ReadOnly Property OwnerFamily As Family
	Get
```
```cpp
public:
property Family^ OwnerFamily {
	Family^ get ();
}
```
```fsharp
member OwnerFamily : Family with get
```

#### Property Value

Family

Only available if the current document is family document.

#### Reference

Document Class

Autodesk.Revit.DB Namespace